Catalogs/НастройкиИнтеркампани.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НастройкиИнтеркампани</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенДляОпределенияСтоимостиПотолкаВВаловойПрибылиРозницы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщикуЗаказыватьМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщикуЗаказыватьТовары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПроизводствоПотолков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентРозничныеПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОднаОрганизацияПроизводстваИПродажиПотолков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПроизводствоПотолков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияРозничныеПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводствоВидЦенТовары</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводствоПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводствоСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводствоСкладОтгрузкиИзПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладРозницыПриПоступленииТоваровОтПроизводства</Name>
					<Comment>#7764</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВыделятьТоварыИМатериалыВОтдельныйЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_НеУчитыватьСтоимостьВЗаказахНаПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОтображатьАдресМонтажаВШапкеДокумента</Name>
					<Comment>#7805</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ПередачаПотолковВРозницуБезПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ПроверятьПоступленияТоваровПриПереводеВОтгруженные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ПроизводствоВидЦенУслугиРаскроя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеныУслугРаскроя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ПроизводствоТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаказовНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_РазрешитьПереводЗаказаВОтгруженБезОформленияРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_СтатусНовогоЗаказаПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьКонтрагентаРозницыВЗаказахНаПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиИнтеркампани/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	Элементы.ГруппаПродаетПотолкиВРозницу.Видимость = НЕ Объект.ОднаОрганизацияПроизводстваИПродажиПотолков;
	Элементы.КонтрагентПроизводствоПотолков.Видимость = НЕ Объект.ОднаОрганизацияПроизводстваИПродажиПотолков;
	
	Элементы.ГруппаПоступлениеТоваровОтПроизводства.Видимость = НЕ Объект.ОднаОрганизацияПроизводстваИПродажиПотолков;
	
	//Элементы.РазрешитьПереводЗаказаВОтгруженБезОформленияРеализации.Видимость = Объект.ОднаОрганизацияПроизводстваИПродажиПотолков;
	
	Если Объект.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
		Объект.ОрганизацияРозничныеПродажи = Объект.ОрганизацияПроизводствоПотолков;
		Если НЕ Объект.УказыватьКонтрагентаРозницыВЗаказахНаПроизводство Тогда
			Объект.КонтрагентРозничныеПродажи = Объект.КонтрагентПроизводствоПотолков;
		КонецЕсли;
		Элементы.ГруппаПроизводитПотолки.Заголовок = "Производит и продает потолки";
		Элементы.ГруппаУказыватьКонтрагентаРозницыВЗаказеНаПроизводство.Видимость = Истина;
	Иначе
		Элементы.ГруппаПроизводитПотолки.Заголовок = "Производит потолки";
		Объект.УказыватьКонтрагентаРозницыВЗаказахНаПроизводство = Ложь;
		Элементы.ГруппаУказыватьКонтрагентаРозницыВЗаказеНаПроизводство.Видимость = Ложь;
	КонецЕсли;
	
	//Элементы.ПроизводствоВидЦенТовары.Видимость = НЕ Объект.НеУчитыватьСтоимостьВЗаказахНаПроизводство;
	Элементы.ПроизводствоВидЦенТовары.Видимость = НЕ Объект.ОднаОрганизацияПроизводстваИПродажиПотолков;
	
	Элементы.КонтрагентРозничныеПродажи1.Видимость = Объект.УказыватьКонтрагентаРозницыВЗаказахНаПроизводство;
	
	//Элементы.ВыделятьТоварыИМатериалыВОтдельныйЗаказ.Видимость = Объект.ЗаказПоставщикуЗаказыватьМатериалы ИЛИ Объект.ЗаказПоставщикуЗаказыватьТовары; //Переход на 2.0
	
КонецПроцедуры

//Начало исключен при переходе на 2.0
//&НаСервере
//Функция ПолучитьДоступныеСтатусыЗаказовНаПроизводство()
//	
//	ВидыСтатусов = Новый СписокЗначений;	
//	ВидыСтатусов.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Новый);	
//	//Начало исключен при переходе на 2.0
//	//Если Константы.ИспользоватьСтатусПодтвержденВПроизводстве.Получить() Тогда
//	//	ВидыСтатусов.Добавить(Справочники.СтатусыЗаказовНаПроизводство.Подтвержден);
//	//КонецЕсли;
//	//Конец исключен при переходе на 2.0
//	ВидыСтатусов.Добавить(Справочники.СтатусыЗаказовНаПроизводство.ВПроизводстве);
//	
//	Возврат ВидыСтатусов;
//	
//КонецФункции
//Конец исключен при переходе на 2.0

//НАЧАЛО: Переход на 2.0
//&НаКлиенте
//Процедура ПроизводствоТекущийСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//
//	СтандартнаяОбработка = Ложь;
//	
//	ДоступныеСтатусы = ПолучитьДоступныеСтатусыЗаказовНаПроизводство();
//	
//	ДанныеВыбора = Новый СписокЗначений;
//	Для НомерСтатуса = 0 По ДоступныеСтатусы.Количество()-1 Цикл
//		ДанныеВыбора.Добавить(ДоступныеСтатусы[НомерСтатуса].Значение);
//	КонецЦикла;
//	
//КонецПроцедуры
//КОНЕЦ: Переход на 2.0

&НаКлиенте
Процедура ОднаОрганизацияПроизводстваИПродажиПотолковПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ОднаОрганизацияПроизводстваИПродажиПотолков Тогда
		ВидИнтеркампани = 1;
	Иначе
		ВидИнтеркампани = 0;
	КонецЕсли;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПроизводствоПотолковПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПроизводствоПотолковПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура НеУчитыватьСтоимостьВЗаказахНаПроизводствоПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура УказыватьКонтрагентаРозницыВЗаказахНаПроизводствоПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПоставщикуЗаказыватьМатериалыПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПоставщикуЗаказыватьТоварыПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВидИнтеркампаниПриИзменении(Элемент)
	Объект.ОднаОрганизацияПроизводстваИПродажиПотолков = ВидИнтеркампани;
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Элементы.СтатусНовогоЗаказаПокупателя.Видимость = Константы.ИспользоватьСтатусНовыйВЗаказеПокупателя.Получить();
	
	Элементы.ПроизводствоСклад.Видимость = Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить();
	
	Если НЕ Константы.ИспользоватьПодразделения.Получить() И НЕ ЗначениеЗаполнено(Объект.ПроизводствоПодразделение) Тогда 
		Элементы.ПроизводствоПодразделение.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры
